benchmark/500k-large-groups/bitmap/wrk2/docker-bitmap-t2-c20-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/bitmap/prices
  2 threads and 20 connections
  Thread calibration: mean lat.: 1.589ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.464ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.52ms  485.50us   5.89ms   68.01%
    Req/Sec     1.06k   142.87     1.55k    69.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.48ms
 75.000%    1.83ms
 90.000%    2.17ms
 99.000%    2.77ms
 99.900%    3.19ms
 99.990%    5.37ms
 99.999%    5.89ms
100.000%    5.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.164     0.000000            1         1.00
       0.921     0.100000         4005         1.11
       1.088     0.200000         7989         1.25
       1.221     0.300000        11980         1.43
       1.349     0.400000        15988         1.67
       1.481     0.500000        19950         2.00
       1.548     0.550000        21959         2.22
       1.615     0.600000        23965         2.50
       1.683     0.650000        25952         2.86
       1.755     0.700000        27953         3.33
       1.831     0.750000        29936         4.00
       1.873     0.775000        30923         4.44
       1.918     0.800000        31943         5.00
       1.968     0.825000        32927         5.71
       2.024     0.850000        33928         6.67
       2.089     0.875000        34925         8.00
       2.127     0.887500        35428         8.89
       2.169     0.900000        35918        10.00
       2.213     0.912500        36421        11.43
       2.261     0.925000        36920        13.33
       2.319     0.937500        37411        16.00
       2.351     0.943750        37670        17.78
       2.389     0.950000        37906        20.00
       2.427     0.956250        38163        22.86
       2.467     0.962500        38407        26.67
       2.515     0.968750        38654        32.00
       2.545     0.971875        38778        35.56
       2.575     0.975000        38904        40.00
       2.609     0.978125        39035        45.71
       2.643     0.981250        39160        53.33
       2.677     0.984375        39281        64.00
       2.697     0.985938        39339        71.11
       2.725     0.987500        39403        80.00
       2.753     0.989062        39467        91.43
       2.785     0.990625        39527       106.67
       2.829     0.992188        39590       128.00
       2.855     0.992969        39624       142.22
       2.877     0.993750        39653       160.00
       2.895     0.994531        39683       182.86
       2.929     0.995313        39714       213.33
       2.967     0.996094        39745       256.00
       2.985     0.996484        39763       284.44
       3.003     0.996875        39776       320.00
       3.027     0.997266        39791       365.71
       3.053     0.997656        39808       426.67
       3.081     0.998047        39823       512.00
       3.089     0.998242        39830       568.89
       3.113     0.998437        39838       640.00
       3.139     0.998633        39846       731.43
       3.155     0.998828        39854       853.33
       3.213     0.999023        39862      1024.00
       3.221     0.999121        39865      1137.78
       3.229     0.999219        39869      1280.00
       3.261     0.999316        39873      1462.86
       3.321     0.999414        39877      1706.67
       3.367     0.999512        39881      2048.00
       3.381     0.999561        39883      2275.56
       3.403     0.999609        39885      2560.00
       3.453     0.999658        39888      2925.71
       3.461     0.999707        39889      3413.33
       3.505     0.999756        39891      4096.00
       3.521     0.999780        39892      4551.11
       3.681     0.999805        39893      5120.00
       3.801     0.999829        39894      5851.43
       3.827     0.999854        39895      6826.67
       5.367     0.999878        39896      8192.00
       5.367     0.999890        39896      9102.22
       5.387     0.999902        39897     10240.00
       5.387     0.999915        39897     11702.86
       5.435     0.999927        39898     13653.33
       5.435     0.999939        39898     16384.00
       5.435     0.999945        39898     18204.44
       5.483     0.999951        39899     20480.00
       5.483     0.999957        39899     23405.71
       5.483     0.999963        39899     27306.67
       5.483     0.999969        39899     32768.00
       5.483     0.999973        39899     36408.89
       5.891     0.999976        39900     40960.00
       5.891     1.000000        39900          inf
#[Mean    =        1.519, StdDeviation   =        0.486]
#[Max     =        5.888, Total count    =        39900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59963 requests in 30.00s, 11.67MB read
Requests/sec:   1998.71
Transfer/sec:    398.18KB